first_routes/app/controllers/artworks_controller.rb

  def index
    # artworks = Artwork.all
    # render json: artworks

    user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    artwork = Artwork.find_by(id: params[:id])

    if artwork
      artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Nude Portrait of Donald Trump"], ["updated_at", "2018-11-13 00:47:23.049475"], ["id", 2]]

  def destroy
    artwork = Artwork.find_by(id: params[:id])

    if artwork
      artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 2]]