first_routes/app/controllers/users_controller.rb

  def update
    user = User.find_by(id: params[:id])

    if user
      user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "j$+=$"], ["updated_at", "2018-11-13 00:32:29.470357"], ["id", 4]]